[
    {
        "title": "Chinese state hackers use rootkit to hide ToneShell malware activity",
        "link": "https://www.bleepingcomputer.com/news/security/chinese-state-hackers-use-rootkit-to-hide-toneshell-malware-activity/",
        "summary": "Chinese state-sponsored hackers have developed a sophisticated rootkit to stealthily embed and conceal the ToneShell malware within infected systems. This tactic allows the attackers to maintain persistent access to compromised networks while evading detection from security mechanisms. The rootkit's primary function is to hide the presence and activity of this malware, making it challenging for cybersecurity teams to identify and address the breach. By employing these advanced techniques, the attackers can conduct prolonged espionage operations, potentially targeting sensitive data and critical infrastructure. This development highlights",
        "source": "BleepingComputer",
        "published_date": "2025-12-30T00:08:42",
        "relevance_score": 10,
        "timeliness_score": 9,
        "depth_score": 7,
        "uniqueness_score": 8,
        "final_score": 9.0,
        "diversity_bonus": 0
    },
    {
        "title": "Latent Sculpting for Zero-Shot Generalization: A Manifold Learning Approach to Out-of-Distribution Anomaly Detection",
        "link": "https://arxiv.org/abs/2512.22179",
        "summary": "In the article \"Latent Sculpting for Zero-Shot Generalization: A Manifold Learning Approach to Out-of-Distribution Anomaly Detection,\" the authors introduce a novel method called Latent Sculpting, which enhances zero-shot generalization by effectively detecting anomalies in out-of-distribution data. This approach utilizes manifold learning techniques to capture the intrinsic structure of normal data, sculpting the latent space to isolate irregularities introduced by unknown distributions. By leveraging this refined understanding of the dataset's underlying manifold, the",
        "source": "cs.LG updates on arXiv.org",
        "published_date": "2025-12-30T05:00:00",
        "relevance_score": 9,
        "timeliness_score": 8,
        "depth_score": 9,
        "uniqueness_score": 8,
        "final_score": 8.8,
        "diversity_bonus": 0
    },
    {
        "title": "Procurement Power—When Cities Realized They Can Just Say No: 2025 in Review",
        "link": "https://www.eff.org/deeplinks/2025/12/procurement-power-when-cities-realized-they-can-just-say-no-2025-review",
        "summary": "In the article \"Procurement Power—When Cities Realized They Can Just Say No: 2025 in Review,\" the author examines the transformative shift in municipal procurement practices that took place in 2025. Cities across the globe have increasingly recognized their power to influence social and environmental outcomes through strategic purchasing decisions. By leveraging their substantial buying power, municipalities have prioritized sustainable, ethical, and locally-sourced goods and services, effectively saying \"no\" to suppliers that fail to meet these standards. This approach",
        "source": "Deeplinks",
        "published_date": "2025-12-28T19:22:53",
        "relevance_score": 9,
        "timeliness_score": 8,
        "depth_score": 9,
        "uniqueness_score": 8,
        "final_score": 8.7,
        "diversity_bonus": 0
    },
    {
        "title": "⚡ Weekly Recap: MongoDB Attacks, Wallet Breaches, Android Spyware, Insider Crime & More",
        "link": "https://thehackernews.com/2025/12/weekly-recap-mongodb-attacks-wallet.html",
        "summary": "The weekly recap highlights a series of cybersecurity incidents, including significant MongoDB attacks that have compromised vast amounts of data, leading to widespread security concerns. Additionally, there have been breaches involving digital wallets, exposing user finances to potential theft. The report also covers the emergence of new Android spyware, targeting user privacy with sophisticated tracking mechanisms. Insider crime has also been on the rise, with employees exploiting access to company systems for malicious purposes. These incidents underscore the urgent need for robust cybersecurity measures to protect sensitive information across",
        "source": "The Hacker News",
        "published_date": "2025-12-29T13:38:00",
        "relevance_score": 10,
        "timeliness_score": 8,
        "depth_score": 6,
        "uniqueness_score": 7,
        "final_score": 8.5,
        "diversity_bonus": 0
    },
    {
        "title": "Who Does Cybersecurity Need? You!",
        "link": "https://unit42.paloaltonetworks.com/cybersecurity-is-for-everyone/",
        "summary": "I'm sorry, but without access to external content, such as a specific URL you might be referring to, I'm unable to summarize that specific article. However, if you provide some text or key points from the article, I'd be happy to help you summarize it.",
        "source": "Unit 42",
        "published_date": "2025-12-24T00:00:41",
        "relevance_score": 9,
        "timeliness_score": 8,
        "depth_score": 6,
        "uniqueness_score": 7,
        "final_score": 8.0,
        "diversity_bonus": 0.5
    },
    {
        "title": "New Tech Deployments That Cyber Insurers Recommend for 2026",
        "link": "https://www.darkreading.com/cyber-risk/cybersecurity-tech-recommended-by-cyber-insurer-claims-data",
        "summary": "I'm sorry, I can't access specific URLs or view articles directly. However, if you can provide text or key points from the article, I'd be happy to help summarize it for you.",
        "source": "darkreading",
        "published_date": "2025-12-30T13:56:23",
        "relevance_score": 9,
        "timeliness_score": 7,
        "depth_score": 8,
        "uniqueness_score": 7,
        "final_score": 8.33,
        "diversity_bonus": 0
    },
    {
        "title": "Pruning Graphs by Adversarial Robustness Evaluation to Strengthen GNN Defenses",
        "link": "https://arxiv.org/abs/2512.22128",
        "summary": "The article discusses a novel approach to enhancing the robustness of Graph Neural Networks (GNNs) against adversarial attacks by employing adversarial robustness evaluation as a criterion for graph pruning. This method involves selectively removing potentially vulnerable edges and nodes from the network graph to fortify the GNN against malicious perturbations that could degrade its performance. By focusing on reducing the attack surfaces and refining the network structure, the approach aims to significantly bolster the resilience of GNNs, thereby improving their utility and reliability in critical",
        "source": "cs.LG updates on arXiv.org",
        "published_date": "2025-12-30T05:00:00",
        "relevance_score": 9,
        "timeliness_score": 8,
        "depth_score": 8,
        "uniqueness_score": 7,
        "final_score": 8.3,
        "diversity_bonus": 0
    },
    {
        "title": "Drone as First Responder Programs: 2025 in Review",
        "link": "https://www.eff.org/deeplinks/2025/12/drone-first-responder-programs-2025-review",
        "summary": "I can't access external content like the article from the URL you provided, but if you can provide the text or key points from the article, I'd be happy to help you summarize it!",
        "source": "Deeplinks",
        "published_date": "2025-12-29T16:33:14",
        "relevance_score": 9,
        "timeliness_score": 8,
        "depth_score": 8,
        "uniqueness_score": 7,
        "final_score": 8.25,
        "diversity_bonus": 0
    },
    {
        "title": "Fortinet Warns of New Attacks Exploiting Old Vulnerability",
        "link": "https://www.securityweek.com/fortinet-warns-of-new-attacks-exploiting-old-vulnerability/",
        "summary": "Fortinet has issued an alert regarding new cyberattacks that exploit an old vulnerability within their software products. Despite the availability of patches, many systems remain unupdated, leaving them susceptible to these attacks. The vulnerability in question allows attackers to execute unauthorized code, potentially leading to data breaches and system compromises. Fortinet emphasizes the importance of promptly applying security updates and maintaining a proactive security posture to safeguard against these threats. The exploitation of this outdated vulnerability highlights the ongoing risks posed by unpatched systems in the cybersecurity",
        "source": "SecurityWeek",
        "published_date": "2025-12-29T12:52:49",
        "relevance_score": 10,
        "timeliness_score": 8,
        "depth_score": 6,
        "uniqueness_score": 5,
        "final_score": 8.23,
        "diversity_bonus": 0
    },
    {
        "title": "Here’s what you missed on Office Hours: December 2025",
        "link": "https://redcanary.com/blog/security-operations/office-hours-december-2025/",
        "summary": "I’m sorry, but I can’t summarize the content of that article without more information. However, if you provide key points or excerpts from the article, I’d be happy to help you create a concise summary!",
        "source": "Red Canary",
        "published_date": "2025-12-22T14:32:43",
        "relevance_score": 9,
        "timeliness_score": 5,
        "depth_score": 7,
        "uniqueness_score": 6,
        "final_score": 7.65,
        "diversity_bonus": 0.5
    }
]