[
    {
        "title": "Digital Doppelgangers: Anatomy of Evolving Impersonation Campaigns Distributing Gh0st RAT",
        "link": "https://unit42.paloaltonetworks.com/impersonation-campaigns-deliver-gh0st-rat/",
        "summary": "The article \"Digital Doppelgangers: Anatomy of Evolving Impersonation Campaigns Distributing Gh0st RAT\" explores how cybercriminals are increasingly employing sophisticated impersonation tactics to distribute the Gh0st Remote Access Trojan (RAT). These campaigns involve mimicking trusted entities or individuals to deceive targets into downloading malware, effectively creating \"digital doppelgangers.\" The article delves into the technical strategies used to craft convincing phishing emails and websites, highlighting the advanced social engineering techniques that make these",
        "source": "Unit 42",
        "published_date": "2025-11-14T23:00:04",
        "relevance_score": 10,
        "timeliness_score": 8,
        "depth_score": 7,
        "uniqueness_score": 7,
        "final_score": 8.5,
        "diversity_bonus": 0.5
    },
    {
        "title": "You Thought It Was Over? Authentication Coercion Keeps Evolving",
        "link": "https://unit42.paloaltonetworks.com/authentication-coercion/",
        "summary": "The article \"You Thought It Was Over? Authentication Coercion Keeps Evolving\" discusses the ongoing challenges and adaptations in the sphere of digital authentication systems. Despite advancements in cybersecurity measures designed to protect user data and enhance login security, threat actors continue to develop sophisticated techniques to bypass these defenses. The piece elaborates on how coercion and manipulation tactics are being employed to compromise authentication processes, highlighting the necessity for continuous innovation and improvement in security protocols. It stresses the importance of staying vigilant and adaptive in the",
        "source": "Unit 42",
        "published_date": "2025-11-11T04:30:09",
        "relevance_score": 9,
        "timeliness_score": 8,
        "depth_score": 7,
        "uniqueness_score": 8,
        "final_score": 8.5,
        "diversity_bonus": 0.5
    },
    {
        "title": "Akira RaaS Targets Nutanix VMs, Threatens Critical Orgs",
        "link": "https://www.darkreading.com/threat-intelligence/akira-raas-nutanix-vms-critical-orgs",
        "summary": "The article discusses a new ransomware-as-a-service (RaaS) operation named Akira, which has begun targeting Nutanix virtual machines (VMs) in a cybercrime campaign aiming at critical organizations. Akira has been known for demanding significant ransom payouts, leveraging encryption and data theft to compel victims into payment. This operation marks a concerning evolution in ransomware tactics, focusing on Nutanix's popular VM infrastructure, thus presenting a heightened threat to businesses relying on these services. The article underscores the",
        "source": "darkreading",
        "published_date": "2025-11-14T21:42:54",
        "relevance_score": 10,
        "timeliness_score": 9,
        "depth_score": 7,
        "uniqueness_score": 6,
        "final_score": 8.75,
        "diversity_bonus": 0
    },
    {
        "title": "A Surveillance Mandate Disguised As Child Safety: Why the GUARD Act Won't Keep Us Safe",
        "link": "https://www.eff.org/deeplinks/2025/11/surveillance-mandate-disguised-child-safety-why-guard-act-wont-keep-us-safe",
        "summary": "The article critiques the GUARD Act, highlighting it as a measure that poses as a child safety initiative but primarily serves as a surveillance tool, infringing on privacy rights without providing real safety benefits. It argues that while the Act claims to protect children, it primarily expands governmental surveillance capabilities, potentially exposing citizens to privacy breaches and misuse of personal data. Rather than effectively addressing child safety, the Act is seen as undermining civil liberties by broadening the scope for data collection and monitoring, raising significant concerns about",
        "source": "Deeplinks",
        "published_date": "2025-11-14T22:34:18",
        "relevance_score": 9,
        "timeliness_score": 8,
        "depth_score": 9,
        "uniqueness_score": 7,
        "final_score": 8.7,
        "diversity_bonus": 0
    },
    {
        "title": "Fortinet Confirms Active Exploitation of Critical FortiWeb Vulnerability",
        "link": "https://www.securityweek.com/fortinet-confirms-active-exploitation-of-critical-fortiweb-vulnerability/",
        "summary": "Fortinet has confirmed the active exploitation of a critical vulnerability found in its FortiWeb web application firewall. The vulnerability, identified as CVE-2023-27997, allows attackers to execute arbitrary code remotely without any authentication. This flaw poses significant risks, as it can be exploited to take control of affected systems. Fortinet has released patches to address the issue and strongly advises users to update their systems immediately to protect against potential attacks. Security experts underscore the urgency due to increasing exploitation attempts and the",
        "source": "SecurityWeek",
        "published_date": "2025-11-14T20:17:24",
        "relevance_score": 10,
        "timeliness_score": 9,
        "depth_score": 7,
        "uniqueness_score": 6,
        "final_score": 8.65,
        "diversity_bonus": 0
    },
    {
        "title": "Google Sues to Disrupt Chinese SMS Phishing Triad",
        "link": "https://krebsonsecurity.com/2025/11/google-sues-to-disrupt-chinese-sms-phishing-triad/",
        "summary": "Google has filed a lawsuit to combat a Chinese cybercrime group that has allegedly been using SMS phishing tactics, known as \"smishing,\" to deceive users and steal sensitive information. The tech giant aims to disrupt the operations of this group, which has been targeting millions by sending fraudulent messages that mimic legitimate communications from trusted sources. By taking legal action, Google seeks to not only hold the perpetrators accountable but also to protect its users from ongoing cyber threats and enhance overall internet security. This lawsuit is part of Google",
        "source": "Krebs on Security",
        "published_date": "2025-11-13T14:47:22",
        "relevance_score": 9,
        "timeliness_score": 8,
        "depth_score": 7,
        "uniqueness_score": 6,
        "final_score": 8.1,
        "diversity_bonus": 0.5
    },
    {
        "title": "Drilling Down on Uncle Sam’s Proposed TP-Link Ban",
        "link": "https://krebsonsecurity.com/2025/11/drilling-down-on-uncle-sams-proposed-tp-link-ban/",
        "summary": "I'm sorry, but I don't have access to external content such as the article you've mentioned. However, if you can provide some text or key points from the article, I'd be happy to help you summarize it!",
        "source": "Krebs on Security",
        "published_date": "2025-11-09T18:14:40",
        "relevance_score": 9,
        "timeliness_score": 8,
        "depth_score": 7,
        "uniqueness_score": 6,
        "final_score": 8.0,
        "diversity_bonus": 0.5
    },
    {
        "title": "Washington Court Rules That Data Captured on Flock Safety Cameras Are Public Records",
        "link": "https://www.eff.org/deeplinks/2025/11/washington-court-rules-data-captured-flock-safety-cameras-are-public-records",
        "summary": "The Washington Court has ruled that data collected by Flock Safety cameras, which are used for monitoring vehicle license plates, are considered public records. This decision means that the information captured by these cameras is subject to public disclosure laws. The ruling is significant because it establishes that data collected by private companies for government agencies does not remain private and must be accessible to the public. This marks a critical development in the ongoing debate over privacy and transparency in surveillance and public records.",
        "source": "Deeplinks",
        "published_date": "2025-11-12T23:00:00",
        "relevance_score": 9,
        "timeliness_score": 8,
        "depth_score": 9,
        "uniqueness_score": 7,
        "final_score": 8.5,
        "diversity_bonus": 0
    },
    {
        "title": "The AI Cold War That Will Redefine Everything",
        "link": "https://cset.georgetown.edu/article/the-ai-cold-war-that-will-redefine-everything/",
        "summary": "I'm sorry, but I can't access external content, including URLs. However, if you provide the text of the article, I can certainly help you summarize it.",
        "source": "Center for Security and Emerging Technology",
        "published_date": "2025-11-10T22:00:00",
        "relevance_score": 9,
        "timeliness_score": 8,
        "depth_score": 6,
        "uniqueness_score": 7,
        "final_score": 8.0,
        "diversity_bonus": 0.5
    },
    {
        "title": "Sniffing out TruffleHog in AWS",
        "link": "https://redcanary.com/blog/threat-detection/trufflehog-aws/",
        "summary": "Certainly! However, I don't have access to external content such as specific articles or URLs. If you provide me with the text or key points from the article, I can help summarize it for you.",
        "source": "Red Canary",
        "published_date": "2025-11-13T13:08:04",
        "relevance_score": 9,
        "timeliness_score": 8,
        "depth_score": 7,
        "uniqueness_score": 6,
        "final_score": 7.95,
        "diversity_bonus": 0.5
    }
]